{
  "math-54": [
    "A matrix is a rectangular array of numbers that represents a linear transformation between vector spaces.",
    "Matrix multiplication corresponds to composing linear transformations.",
    "The identity matrix represents the transformation that leaves every vector unchanged.",
    "A square matrix is invertible if and only if its determinant is nonzero.",
    "The determinant measures how a linear transformation scales area or volume.",
    "If a matrix has determinant zero, it collapses space into a lower dimension.",
    "Row reduction is a method for solving systems of linear equations by simplifying the matrix.",
    "A homogeneous system always has the trivial solution where all variables are zero.",
    "The null space of a matrix is the set of all vectors mapped to zero by the transformation.",
    "The column space of a matrix is the span of its columns.",
    "The rank of a matrix is the dimension of its column space.",
    "Rank tells you how many linearly independent columns a matrix has.",
    "The Rank-Nullity Theorem states that rank plus nullity equals the number of columns.",
    "Eigenvectors are nonzero vectors whose direction does not change under a linear transformation.",
    "Eigenvalues tell you how much an eigenvector is scaled by the transformation.",
    "A matrix has a nontrivial null space if and only if zero is an eigenvalue.",
    "Eigenvalues are found by solving the characteristic equation det(A − λI) = 0.",
    "Diagonalizable matrices have a basis of eigenvectors.",
    "Diagonalization simplifies matrix powers and differential equation systems.",
    "Not all matrices are diagonalizable, even if they have eigenvalues.",
    "Symmetric matrices are always diagonalizable with real eigenvalues.",
    "Orthogonal matrices preserve lengths and angles.",
    "The transpose of a matrix flips rows and columns.",
    "A matrix is orthogonal if its transpose equals its inverse.",
    "An orthonormal basis consists of vectors that are orthogonal and have unit length.",
    "The dot product measures how much two vectors point in the same direction.",
    "Two vectors are orthogonal if their dot product is zero.",
    "The Gram-Schmidt process turns a linearly independent set into an orthonormal basis.",
    "Projection measures the component of one vector in the direction of another.",
    "Least squares finds the best approximate solution to an overdetermined system.",
    "Least squares solutions minimize the total squared error.",
    "A first-order linear differential equation has the form y' + p(t)y = g(t).",
    "An integrating factor is used to solve first-order linear differential equations.",
    "Second-order linear differential equations involve the second derivative of a function.",
    "Homogeneous differential equations have zero on the right-hand side.",
    "The characteristic equation determines solutions to linear differential equations with constant coefficients.",
    "Complex roots lead to solutions involving sine and cosine.",
    "A system of differential equations can be written using matrices."
  ],
  "history": [
    "Cleopatra lived closer in time to the Moon landing than to the construction of the Great Pyramid of Giza.",
    "Oxford University is older than the Aztec Empire—teaching began there in 1096.",
    "Napoleon was actually average height for his time—the 'short' myth came from British propaganda.",
    "The shortest war in history lasted 38-45 minutes: Britain vs. Zanzibar in 1896.",
    "Julius Caesar was kidnapped by pirates and joked that he'd have them executed—which he later did.",
    "The Spanish Armada's defeat in 1588 marked the decline of Spanish naval dominance and the rise of England.",
    "The Berlin Wall stood from 1961 to 1989, symbolizing the Cold War division of Europe.",
    "The fall of the Roman Empire in 476 AD marked the end of ancient history and the beginning of the Middle Ages.",
    "The Renaissance period (14th-17th centuries) saw a rebirth of art, science, and learning in Europe.",
    "The American Civil War (1861-1865) was the deadliest conflict in U.S. history, with over 600,000 deaths.",
    "The Renaissance began in Italy around 1300 and spread across Europe over the next three centuries.",
    "The Mongol Empire, under Genghis Khan, was the largest contiguous land empire in history.",
    "The fall of Constantinople in 1453 marked the end of the Byzantine Empire and the rise of the Ottomans.",
    "The Battle of Hastings in 1066 changed the course of English history, introducing Norman rule.",
    "The Magna Carta, signed in 1215, established the principle that everyone, including the king, is subject to the law.",
    "The Protestant Reformation, started by Martin Luther in 1517, split Western Christianity."
  ],
  "science": [
    "Lightning strikes the Earth about 100 times per second.",
    "There are more possible games of chess than atoms in the observable universe.",
    "A day on Venus is longer than its year—Venus rotates slower than it orbits the sun.",
    "Dolphins have names for each other—they use signature whistles.",
    "The human nose can detect over 1 trillion different scents.",
    "A teaspoon of neutron star material would weigh 6 billion tons on Earth.",
    "Atoms are 99.9999999% empty space—if an atom were the size of a football stadium, the nucleus would be a marble.",
    "Octopuses have three hearts—two pump blood to the gills, one pumps blood to the body.",
    "The speed of light is 186,282 miles per second, fast enough to circle Earth 7.5 times in one second.",
    "DNA from a single human cell, if stretched out, would be about 6 feet long.",
    "Black holes can spin at nearly the speed of light, distorting space-time around them.",
    "Water is the only substance on Earth that naturally exists in all three states: solid, liquid, and gas.",
    "The human brain contains approximately 86 billion neurons, each connected to thousands of others.",
    "A single cloud can weigh more than a million pounds, yet it floats because air has weight too.",
    "The Great Red Spot on Jupiter is a storm that's been raging for at least 400 years and is larger than Earth.",
    "Sound travels about 4 times faster in water than in air—1,482 meters per second vs 343 meters per second.",
    "The sun converts about 600 million tons of hydrogen into helium every second, releasing enormous amounts of energy.",
    "Your body contains about 37.2 trillion cells, and each cell contains roughly 2 meters of DNA.",
    "The Andromeda Galaxy is approaching the Milky Way at 110 kilometers per second (they'll collide in about 4.5 billion years).",
    "Gold is so rare that all the gold ever mined could fit into a single cube about 67 feet on each side.",
    "The deepest part of the ocean, the Mariana Trench, is deeper than Mount Everest is tall (about 36,000 feet deep).",
    "The human eye can distinguish about 10 million different colors, though we only have three types of color receptors."
  ],
  "berkeley-fun-facts": [
    "UC Berkeley was founded in 1868 and is the original campus of the University of California system.",
    "UC Berkeley is named after philosopher George Berkeley, whose ideas inspired the founders.",
    "UC Berkeley has produced over 100 Nobel Prize winners across science, economics, and literature.",
    "The Campanile (Sather Tower) stands 307 feet tall and is the 3rd tallest university clock tower in the world.",
    "South Hall, built in 1873, is the oldest building still standing on the UC Berkeley campus.",
    "There is a tiny stone bear statue hidden on South Hall of UC Berkeley, often called the smallest bear on campus.",
    "The UC Berkeley campus covers about 178 acres, filled with redwoods, eucalyptus trees, and historic paths.",
    "The city of Berkeley was originally called Ocean View before being renamed.",
    "Oski the Bear has been Cal's official mascot since 1941.",
    "The original Berkeley Bowl location formerly housed a bowling alley.",
    "Berkeley has one of the highest rates of biking and public transit use among U.S. universities.",
    "The UC Berkeleycampus layout was inspired by classical European universities.",
    "The Campanile bells are sometimes played live by student musicians.",
    "UC Berkeley's motto 'Fiat Lux' translates to 'Let there be light.'",
    "The Big C on the hill is repainted every year before Big Game by students hiking up in the dark.",
    "There are steam tunnels under parts of campus that students have historically tried to explore.",
    "UC Berkeley once had a secret nuclear reactor underneath campus for research purposes.",
    "The Free Speech Movement started after a Cal student was arrested for setting up a political table.",
    "There are hidden plaques around campus that most Cal students walk past without noticing.",
    "Some Cal students believe touching the nose of the South Hall bear statue brings good luck.",
    "There are rumors of tunnels connecting old academic buildings at UC Berkeley from the early 1900s.",
    "UC Berkeley once experimented with student-run housing models that failed spectacularly.",
    "The Campanile bells were silenced during WWII to avoid confusing air raid signals.",
    "Some staircases on campus were designed intentionally uneven to slow people down.",
    "There are classrooms on the UC Berkeley campus that are rarely used because of structural quirks.",
    "UC Berkeley once considered banning Greek life entirely in the 1970s.",
    "Some buildings at UC Berkeley still have chalkboards that haven't been cleaned in decades.",
    "The original UC Berkeleycampus plans included far more classical architecture than exists today.",
    "UC Berkeley once hosted classified government research without students knowing."
  ],
  "miscellaneous": [
    "The first computer bug was an actual bug—a moth found in Harvard's Mark II computer in 1947.",
    "A single Google search uses about 0.3 watt-hours of energy, equivalent to turning on a 60W light bulb for 17 seconds.",
    "The word 'robot' comes from the Czech word 'robota', meaning forced labor or work.",
    "The first email was sent in 1971 by Ray Tomlinson, who also chose the @ symbol for email addresses.",
    "Your smartphone has more computing power than the computers that sent humans to the moon.",
    "The 'Dunning-Kruger effect' describes how people with low ability overestimate their competence.",
    "It takes about 66 days on average to form a new habit, not the commonly cited 21 days.",
    "Your brain uses about 20% of your body's total energy, despite being only 2% of your body weight.",
    "The 'mere exposure effect' means you tend to prefer things you've seen before, even if you don't remember seeing them.",
    "Multitasking is a myth—your brain actually switches rapidly between tasks, reducing efficiency by up to 40%.",
    "Compound interest is called the 'eighth wonder of the world'—money invested at 7% doubles every 10 years.",
    "The term 'bull market' comes from how bulls attack—thrusting upward with their horns.",
    "Warren Buffett reads 80% of his day, believing knowledge builds up like compound interest.",
    "The first credit card was introduced in 1950 by Diners Club, made of cardboard.",
    "Inflation means your money loses about 2-3% of its purchasing power each year on average.",
    "Octopuses have three hearts and blue blood.",
    "A group of flamingos is called a 'flamboyance'.",
    "Bananas are berries, but strawberries aren't.",
    "Honey never spoils—archaeologists have found 3000-year-old honey that's still edible.",
    "Wombat poop is cube-shaped to prevent it from rolling away.",
    "Laughing for 15 minutes burns about 40 calories.",
    "Your body produces about 1.5 liters of saliva per day.",
    "The human heart beats about 100,000 times per day.",
    "You're taller in the morning—your spine compresses throughout the day.",
    "Exercise boosts brain function by increasing blood flow and oxygen to the brain."
  ]
}
